engr-ping/AUTOSAR_CP_CODE/src/bsw/OnBoardDevices/Tle941xy/Tle941xy.c
/*****************************************************************************************************************
******************************************************************************************************************
*  Copyright (C) .                                                                            
*  All rights reserved.                                                                                           
******************************************************************************************************************
*  FileName: Tle941xy                                                                                             
*  Content:  Tle941xy family drive
*  Category: Tle94103 Tle94104 Tle94106 Tle94108 Tle94110 Tle94112 
******************************************************************************************************************
*  Revision Management                                                                                            
*  yyyy.mm.dd    name              version      description                                                       
*  ----------    --------          -------      -----------------------------------                               
*  2022.03.30    clipping            v0001        Frist edit                                                        
******************************************************************************************************************
******************************************************************************************************************/
/* Include Headerfiles  */
#include "Tle941xy.h"
#include "Tle941xy_Types.h"
#include "Pfm.h"

static uint8 sTle941xy_u8GlobalStatus[TLE941XY_GROUP_MAX][TLE941XY_CHIP_MAX];
static uint8 sTle941xy_u8PwmDuty[TLE941XY_GROUP_MAX][TLE941XY_CHIP_MAX][TLE941XY_PWM_CHN_MAX];
static uint8 sTle941xy_u8HbOutSts[TLE941XY_GROUP_MAX][TLE941XY_CHIP_MAX][TLE941XY_CHANNEL_MAX];
static PFM_DefectReportState_t sTle941xy_atDiagResult[TLE941XY_GROUP_MAX][TLE941XY_CHIP_MAX][TLE941XY_CHANNEL_MAX];
static Tle941xy_RegDataType sTle941xy_atRegData[TLE941XY_GROUP_MAX][TLE941XY_CHIP_MAX];
/****************************************************************************************
|     Function Source Code
|***************************************************************************************/

static void Tle941xy_Recovery(uint8 u8GroupId,uint8* pu8RegBuf);
static void Tle941xy_WriteReg(uint8 u8GroupId,uint8* pu8RegBuf, uint8* pu8WtData);
static void Tle941xy_ReadReg( uint8 u8GroupId,uint8* pu8RegBuf,uint8* pu8ReadBuf);

static void Tle941xy_SetHbPwmDutyReg(uint8 u8Group);
static void Tle941xy_ReadDeviceIdReg(uint8 u8Group);
static void Tle941xy_SetFmPwmFreqReg(uint8 u8Group);
static void Tle941xy_SetHbOutputReg(uint8 u8Group);
static void Tle941xy_SetHbModeReg(uint8 u8Group);
static void Tle941xy_ShortDiagnostic(uint8 u8Group);
static void Tle941xy_SetFwOlReg(uint8 u8Group);
static void Tle941xy_OLDiagnostic(uint8 u8Group);
/****************************************************************************************
| NAME:    Tle941xy_WriteReg
| CALLED BY:
| PRECONDITIONS:     NA
| INPUT PARAMETERS:    uint16 buf
| RETURN VALUE:     void
| DESCRIPTION:      recovery tle941xy output (overload)
****************************************************************************************/
static void Tle941xy_WriteReg(uint8 u8GroupId,uint8* pu8RegBuf, uint8* pu8WtData)
{
    uint8 l_u8ChipIndex;
    uint8 l_u8ChipNum;
    uint8 l_au8RcvDataBuf[TLE941XY_CHIP_MAX * 2] = {0};
    uint8 l_au8SndDataBuf[TLE941XY_CHIP_MAX * 2] = {0};

    l_u8ChipNum = *cTle941xy_atGroupCfg[u8GroupId].pu8ChipNum;

    if(l_u8ChipNum > 0u)
    {
        /* Reversal data buffer */
        for(l_u8ChipIndex = 0u; l_u8ChipIndex < l_u8ChipNum; l_u8ChipIndex++)
        {
            l_au8SndDataBuf[l_u8ChipIndex] =(uint8)(TLE941XY_BASE_ADDR 
                                            | (uint8)(TLE941XY_LABT_OFF << 1u) 
                                            | (uint8)(pu8RegBuf[(l_u8ChipIndex)] << 2u) 
                                            | (uint8)(TLE941XY_WRITE << 7u));
            l_au8SndDataBuf[l_u8ChipIndex + l_u8ChipNum] = pu8WtData[l_u8ChipIndex] ;
        }
        /****The last chip control LABT is 1 whether it is daisy chain communication or not********/
        l_au8SndDataBuf[l_u8ChipNum - 1u] |= (TLE941XY_LABT_ON << 1u);

        /* Send Read  */
        (void)Spi_SetupEB(cTle941xy_atGroupCfg[u8GroupId].SpiChannel, &l_au8SndDataBuf[0], &l_au8RcvDataBuf[0], (l_u8ChipNum * 2));

        (void)Spi_SyncTransmit(cTle941xy_atGroupCfg[u8GroupId].SpiSequence);

        for(l_u8ChipIndex = 0u; l_u8ChipIndex < l_u8ChipNum; l_u8ChipIndex++)
        {
            sTle941xy_u8GlobalStatus[u8GroupId][l_u8ChipIndex] = l_au8RcvDataBuf[(l_u8ChipNum - l_u8ChipIndex - 1u)];
        }
    }
    else
    {

    }
}

/****************************************************************************************
| NAME:    Tle941xy_ReadReg
| CALLED BY:
| PRECONDITIONS:     NA
| INPUT PARAMETERS:    uint16 buf
| RETURN VALUE:     uint16
| DESCRIPTION:      recovery tle941xy output (overload)
****************************************************************************************/
static void Tle941xy_ReadReg( uint8 u8GroupId,uint8* pu8RegBuf,uint8* pu8ReadBuf)
{
    uint8 l_u8ChipIndex;
    uint8 l_u8ChipNum;
    uint16 l_au8RcvDataBuf[TLE941XY_CHIP_MAX * 2u] = {0};
    uint16 l_au8SndDataBuf[TLE941XY_CHIP_MAX * 2u] = {0};

    l_u8ChipNum = *cTle941xy_atGroupCfg[u8GroupId].pu8ChipNum;

    if(l_u8ChipNum > 0u)
    {
        /* Reversal data buffer */
        for(l_u8ChipIndex = 0u; l_u8ChipIndex < l_u8ChipNum; l_u8ChipIndex++)
        {
            l_au8SndDataBuf[l_u8ChipIndex] =(uint8)(TLE941XY_BASE_ADDR 
                                            | (uint8)(TLE941XY_LABT_OFF << 1u) 
                                            | (uint8)(pu8RegBuf[(l_u8ChipIndex)] << 2u) 
                                            | (uint8)(TLE941XY_READ << 7u));
        }
        /****The last chip control LABT is 1 whether it is daisy chain communication or not********/
        l_au8SndDataBuf[l_u8ChipNum - 1u] |= (uint8)(TLE941XY_LABT_ON << 1u);

        /* Send Read  */
        (void)Spi_SetupEB(cTle941xy_atGroupCfg[u8GroupId].SpiChannel, &l_au8SndDataBuf[0], &l_au8RcvDataBuf[0], (l_u8ChipNum * 2u));

        (void)Spi_SyncTransmit(cTle941xy_atGroupCfg[u8GroupId].SpiSequence);

        for(l_u8ChipIndex = 0u; l_u8ChipIndex < l_u8ChipNum; l_u8ChipIndex++)
        {
            pu8ReadBuf[l_u8ChipIndex] = l_au8RcvDataBuf[(l_u8ChipNum * 2u - l_u8ChipIndex - 1u)];
        }
    }
    else
    {

