engr-ping/AUTOSAR_CP_CODE/src/bsw/OnBoardDevices/Tle941xy/Tle941xy.c
    }

}

static void Tle941xy_SetHbOutputReg(uint8 u8Group)
{
    uint8 j;
    uint8 l_au8RegBuf[TLE941XY_CHIP_MAX] = {0};
    uint8 l_au8DataBuf[TLE941XY_CHIP_MAX] = {0};
    uint8 l_u8ChipNum;

    l_u8ChipNum = *cTle941xy_atGroupCfg[u8Group].pu8ChipNum;
    /***OUT1-OUT4**/
    for(j = 0u;j<l_u8ChipNum;j++)
    {
        l_au8RegBuf[j] = TLE941XY_HB_ACT_1_CTRL;
        l_au8DataBuf[j] = (sTle941xy_u8HbOutSts[u8Group][j][0] 
                        | (uint8)(sTle941xy_u8HbOutSts[u8Group][j][1] << 2u)
                        | (uint8)(sTle941xy_u8HbOutSts[u8Group][j][2] << 4u)
                        | (uint8)(sTle941xy_u8HbOutSts[u8Group][j][3] << 6u));
    }
    sTle941xy_atRegData[u8Group][j].HB_ACT_1_CTRL = l_au8DataBuf[j];
    Tle941xy_WriteReg(u8Group,l_au8RegBuf,l_au8DataBuf);
#if((TLE941XY_TLE94106_CHIP_EN == STD_ON)||(TLE941XY_TLE94108_CHIP_EN == STD_ON)||(TLE941XY_TLE94110_CHIP_EN == STD_ON)||(TLE941XY_TLE94112_CHIP_EN == STD_ON))
    /***OUT5-OUT8**/
    for(j = 0u;j < l_u8ChipNum;j++)
    {
        l_au8RegBuf[j] = TLE941XY_HB_ACT_2_CTRL;
        l_au8DataBuf[j] = (sTle941xy_u8HbOutSts[u8Group][j][4] 
                        | (uint8)(sTle941xy_u8HbOutSts[u8Group][j][5] << 2u)
                        | (uint8)(sTle941xy_u8HbOutSts[u8Group][j][6] << 4u)
                        | (uint8)(sTle941xy_u8HbOutSts[u8Group][j][7] << 6u));
    }
    sTle941xy_atRegData[u8Group][j].HB_ACT_2_CTRL = l_au8DataBuf[j];
    Tle941xy_WriteReg(u8Group,l_au8RegBuf,l_au8DataBuf);
#endif
#if((TLE941XY_TLE94110_CHIP_EN == STD_ON)||(TLE941XY_TLE94112_CHIP_EN == STD_ON))
    /***OUT9-OUT12**/
    for(j = 0u;j < l_u8ChipNum;j++)
    {
        l_au8RegBuf[j] = TLE941XY_HB_ACT_3_CTRL;
        l_au8DataBuf[j] = (sTle941xy_u8HbOutSts[u8Group][j][8] 
                        | (uint8)(sTle941xy_u8HbOutSts[u8Group][j][9] << 2u)
                        | (uint8)(sTle941xy_u8HbOutSts[u8Group][j][10] << 4u)
                        | (uint8)(sTle941xy_u8HbOutSts[u8Group][j][11] << 6u));
    }
    sTle941xy_atRegData[u8Group][j].HB_ACT_3_CTRL = l_au8DataBuf[j];
    Tle941xy_WriteReg(u8Group,l_au8RegBuf,l_au8DataBuf);
#endif
}

static void Tle941xy_SetHbModeReg(uint8 u8Group)
{
    uint8 j;
    uint8 l_au8RegBuf[TLE941XY_CHIP_MAX] = {0};
    uint8 l_au8DataBuf[TLE941XY_CHIP_MAX] = {0};
    uint8 l_u8ChipNum;

    l_u8ChipNum = *cTle941xy_atGroupCfg[u8Group].pu8ChipNum;
    /***OUT1-OUT4**/
    for(j = 0u;j<l_u8ChipNum;j++)
    {
        l_au8RegBuf[j] = TLE941XY_HB_MODE_1_CTRL;
        l_au8DataBuf[j] = (cTle941xy_au8ChnModeCfg[u8Group][j][0] 
                        | (uint8)(cTle941xy_au8ChnModeCfg[u8Group][j][1] << 2u)
                        | (uint8)(cTle941xy_au8ChnModeCfg[u8Group][j][2] << 4u)
                        | (uint8)(cTle941xy_au8ChnModeCfg[u8Group][j][3] << 6u));
    }
    sTle941xy_atRegData[u8Group][j].HB_MODE_1_CTRL = l_au8DataBuf[j];
    Tle941xy_WriteReg(u8Group,l_au8RegBuf,l_au8DataBuf);
#if((TLE941XY_TLE94106_CHIP_EN == STD_ON)||(TLE941XY_TLE94108_CHIP_EN == STD_ON)||(TLE941XY_TLE94110_CHIP_EN == STD_ON)||(TLE941XY_TLE94112_CHIP_EN == STD_ON))
    /***OUT5-OUT8**/
    for(j = 0u;j < l_u8ChipNum;j++)
    {
        l_au8RegBuf[j] = TLE941XY_HB_MODE_2_CTRL;
        l_au8DataBuf[j] = (cTle941xy_au8ChnModeCfg[u8Group][j][4] 
                        | (uint8)(cTle941xy_au8ChnModeCfg[u8Group][j][5] << 2u)
                        | (uint8)(cTle941xy_au8ChnModeCfg[u8Group][j][6] << 4u)
                        | (uint8)(cTle941xy_au8ChnModeCfg[u8Group][j][7] << 6u));
    }
    sTle941xy_atRegData[u8Group][j].HB_MODE_2_CTRL = l_au8DataBuf[j];
    Tle941xy_WriteReg(u8Group,l_au8RegBuf,l_au8DataBuf);
#endif
#if((TLE941XY_TLE94110_CHIP_EN == STD_ON)||(TLE941XY_TLE94112_CHIP_EN == STD_ON))
    /***OUT9-OUT12**/
    for(j = 0u;j < l_u8ChipNum;j++)
    {
        l_au8RegBuf[j] = TLE941XY_HB_MODE_3_CTRL;
        l_au8DataBuf[j] = (cTle941xy_au8ChnModeCfg[u8Group][j][8] 
                        | (uint8)(cTle941xy_au8ChnModeCfg[u8Group][j][9] << 2u)
                        | (uint8)(cTle941xy_au8ChnModeCfg[u8Group][j][10] << 4u)
                        | (uint8)(cTle941xy_au8ChnModeCfg[u8Group][j][11] << 6u));
    }
    sTle941xy_atRegData[u8Group][j].HB_MODE_3_CTRL = l_au8DataBuf[j];   
    Tle941xy_WriteReg(u8Group,l_au8RegBuf,l_au8DataBuf);
#endif
}

static void Tle941xy_SetFmPwmFreqReg(uint8 u8Group)
{
    uint8 j;
    uint8 l_au8RegBuf[TLE941XY_CHIP_MAX] = {0};
    uint8 l_au8DataBuf[TLE941XY_CHIP_MAX] = {0};
    uint8 l_u8ChipNum;

    l_u8ChipNum = *cTle941xy_atGroupCfg[u8Group].pu8ChipNum;
    /***OUT1-OUT4**/
    for(j = 0u;j < l_u8ChipNum;j++)
    {
        if((cTle941xy_atChipCfg[u8Group][j].Tle941xyChipId == TLE941XY_TLE94103) ||(cTle941xy_atChipCfg[u8Group][j].Tle941xyChipId == TLE941XY_TLE94104))
        {
            l_au8RegBuf[j] = TLE941XY_FM_CLK_CTRL;
        }
        else
        {
            l_au8RegBuf[j] = TLE941XY_PWM_CH_FREQ_CTRL;
        }
        l_au8DataBuf[j] = (cTle941xy_atChipFmPwmFreqCfg[u8Group][j].u8FmFreq
                        | (uint8)(cTle941xy_atChipFmPwmFreqCfg[u8Group][j].u8Pwm1Freq << 2u)
                        | (uint8)(cTle941xy_atChipFmPwmFreqCfg[u8Group][j].u8Pwm2Freq << 4u)
                        | (uint8)(cTle941xy_atChipFmPwmFreqCfg[u8Group][j].u8Pwm3Freq << 6u));
    }
    sTle941xy_atRegData[u8Group][j].PWM_CH_FREQ_CTRL = l_au8DataBuf[j];
    Tle941xy_WriteReg(u8Group,l_au8RegBuf,l_au8DataBuf);
}

static void Tle941xy_ReadDeviceIdReg(uint8 u8Group)
{
    uint8 j;
    uint8 l_au8RegBuf[TLE941XY_CHIP_MAX] = {0};
    uint8 l_au8DataBuf[TLE941XY_CHIP_MAX] = {0};
    uint8 l_u8ChipNum;

    l_u8ChipNum = *cTle941xy_atGroupCfg[u8Group].pu8ChipNum;
    for(j = 0u;j<l_u8ChipNum;j++)
    {
        l_au8RegBuf[j] = TLE941XY_CONFIG_CTRL;
    }
    sTle941xy_atRegData[u8Group][j].CONFIG_CTRL = l_au8DataBuf[j];
    Tle941xy_ReadReg(u8Group,l_au8RegBuf,l_au8DataBuf);
}


static void Tle941xy_SetHbPwmDutyReg(uint8 u8Group)
{
#if((TLE941XY_TLE94106_CHIP_EN == STD_ON)||(TLE941XY_TLE94108_CHIP_EN == STD_ON)||(TLE941XY_TLE94110_CHIP_EN == STD_ON)||(TLE941XY_TLE94112_CHIP_EN == STD_ON))
    uint8 j;
    uint8 l_au8RegBuf[TLE941XY_CHIP_MAX] = {0};
    uint8 l_au8DataBuf[TLE941XY_CHIP_MAX] = {0};
    uint8 l_u8ChipNum;

    l_u8ChipNum = *cTle941xy_atGroupCfg[u8Group].pu8ChipNum;

    for(j = 0u;j<l_u8ChipNum;j++)
    {
        l_au8RegBuf[j] = TLE941XY_PWM1_DC_CTRL;
        l_au8DataBuf[j] = sTle941xy_u8PwmDuty[u8Group][j][0];
    }
    sTle941xy_atRegData[u8Group][j].PWM1_DC_CTRL = l_au8DataBuf[j];
    Tle941xy_WriteReg(u8Group,l_au8RegBuf,l_au8DataBuf);

    for(j = 0u;j<l_u8ChipNum;j++)
    {
        l_au8RegBuf[j] = TLE941XY_PWM2_DC_CTRL;
        l_au8DataBuf[j] = sTle941xy_u8PwmDuty[u8Group][j][1];
    }
    sTle941xy_atRegData[u8Group][j].PWM2_DC_CTRL = l_au8DataBuf[j];
    Tle941xy_WriteReg(u8Group,l_au8RegBuf,l_au8DataBuf);

    for(j = 0u;j<l_u8ChipNum;j++)
    {
        l_au8RegBuf[j] = TLE941XY_PWM3_DC_CTRL;
        l_au8DataBuf[j] = sTle941xy_u8PwmDuty[u8Group][j][2];
    }
    sTle941xy_atRegData[u8Group][j].PWM3_DC_CTRL = l_au8DataBuf[j];
    Tle941xy_WriteReg(u8Group,l_au8RegBuf,l_au8DataBuf);

#endif
}

