engr-ping/AUTOSAR_CP_CODE/src/bsw/OnBoardDevices/Tle941xy/Tle941xy.c
static void Tle941xy_SetFwOlReg(uint8 u8Group)
{
    uint8 j;
    uint8 l_au8RegBuf[TLE941XY_CHIP_MAX] = {0};
    uint8 l_au8DataBuf[TLE941XY_CHIP_MAX] = {0};
    uint8 l_u8ChipNum;

    l_u8ChipNum = *cTle941xy_atGroupCfg[u8Group].pu8ChipNum;

#if((TLE941XY_TLE94106_CHIP_EN == STD_ON)||(TLE941XY_TLE94108_CHIP_EN == STD_ON)||(TLE941XY_TLE94110_CHIP_EN == STD_ON)||(TLE941XY_TLE94112_CHIP_EN == STD_ON))
    /***OUT5-OUT8**/
    for(j = 0u;j < l_u8ChipNum;j++)
    {
        l_au8RegBuf[j] = TLE941XY_FW_OL_CTRL;
        l_au8DataBuf[j] = (cTle941xy_abChipHS1And2LedModeCfg[u8Group][j][0] 
                        | (uint8)(cTle941xy_abChipHS1And2LedModeCfg[u8Group][j][1] << 1u)
                        | (uint8)(cTle941xy_abChipFreeWheelingCfg[u8Group][j][0] << 2u)
                        | (uint8)(cTle941xy_abChipFreeWheelingCfg[u8Group][j][1] << 3u)
                        | (uint8)(cTle941xy_abChipFreeWheelingCfg[u8Group][j][2] << 4u)
                        | (uint8)(cTle941xy_abChipFreeWheelingCfg[u8Group][j][3] << 5u)
                        | (uint8)(cTle941xy_abChipFreeWheelingCfg[u8Group][j][4] << 6u)
                        | (uint8)(cTle941xy_abChipFreeWheelingCfg[u8Group][j][5] << 7u));
    }
    sTle941xy_atRegData[u8Group][j].FW_OL_CTRL = l_au8DataBuf[j];
    Tle941xy_WriteReg(u8Group,l_au8RegBuf,l_au8DataBuf);
#endif
#if((TLE941XY_TLE94103_CHIP_EN == STD_ON)||(TLE941XY_TLE94104_CHIP_EN == STD_ON)||(TLE941XY_TLE94108_CHIP_EN == STD_ON)||(TLE941XY_TLE94110_CHIP_EN == STD_ON)||(TLE941XY_TLE94112_CHIP_EN == STD_ON))
    /***OUT9-OUT12**/
    for(j = 0u;j < l_u8ChipNum;j++)
    {
        l_au8RegBuf[j] = TLE941XY_FW_CTRL;
        l_au8DataBuf[j] = (cTle941xy_abChipFreeWheelingCfg[u8Group][j][6] 
                        | (uint8)(cTle941xy_abChipFreeWheelingCfg[u8Group][j][7] << 1u)
                        | (uint8)(cTle941xy_abChipFreeWheelingCfg[u8Group][j][8] << 2u)
                        | (uint8)(cTle941xy_abChipFreeWheelingCfg[u8Group][j][9] << 3u)
                        | (uint8)(cTle941xy_abChipFreeWheelingCfg[u8Group][j][10] << 4u)
                        | (uint8)(cTle941xy_abChipFreeWheelingCfg[u8Group][j][11] << 5u)
                        | (uint8)(cTle941xy_abChipFreeWheelingCfg[u8Group][j][0] << 6u)
                        | (uint8)(cTle941xy_abChipFreeWheelingCfg[u8Group][j][0] << 7u));
    }
    sTle941xy_atRegData[u8Group][j].FW_CTRL = l_au8DataBuf[j];
    Tle941xy_WriteReg(u8Group,l_au8RegBuf,l_au8DataBuf);
#endif
}

/****************************************************************************************
| NAME:    Tle941xy_ShortDiagnostic
| CALLED BY:
| PRECONDITIONS:     NA
| INPUT PARAMETERS:    void
| RETURN VALUE:     void
| DESCRIPTION:      recovery Tle941xy output (overload)
****************************************************************************************/
static void Tle941xy_ShortDiagnostic(uint8 u8Group)
{
    uint8 j;
    uint8 k;
    uint8 l_au8RegBuf[TLE941XY_CHIP_MAX] = {0};
    uint8 l_au8DataBuf[TLE941XY_CHIP_MAX] = {0};
    uint8 l_u8ChipNum;
    uint8 l_u8DisplacementLen;
    uint8 l_u8ChipShortFlag;

    l_u8ChipNum = *cTle941xy_atGroupCfg[u8Group].pu8ChipNum;
    /***OUT1-OUT4**/
    for(j = 0u;j < l_u8ChipNum;j++)
    {
        l_au8RegBuf[j] = TLE941XY_SYS_DIAG_2;
    }
    Tle941xy_ReadReg(u8Group,l_au8RegBuf,l_au8DataBuf);
    sTle941xy_atRegData[u8Group][j].SYS_DIAG_2 = l_au8DataBuf[j];
    for(j = 0u;j < l_u8ChipNum;j++)
    {
        for(j = 0u;k < 4u;k++)
        {
            l_u8DisplacementLen = (uint8)(k * 2u);
            if((l_au8RegBuf[j] && (0x03u << l_u8DisplacementLen)) != 0x00u)
            {
                l_u8ChipShortFlag++;
                if(sTle941xy_u8HbOutSts[u8Group][j][k] == TLE941XY_OUT_STATUS_LS)
                {
                    sTle941xy_atDiagResult[u8Group][j][k].eShort2Vcc = PFM_DDS_POS;
                }
                else
                {
                    sTle941xy_atDiagResult[u8Group][j][k].eShort2Gnd = PFM_DDS_POS;
                }
            }
            else
            {
                sTle941xy_atDiagResult[u8Group][j][k].eShort2Vcc = PFM_DDS_NEG;
                sTle941xy_atDiagResult[u8Group][j][k].eShort2Gnd = PFM_DDS_NEG;
            }
        }
    }
    if(l_u8ChipShortFlag > 0u)
    {
        Tle941xy_Recovery(u8Group,l_au8RegBuf);
    }
    else
    {
        
    }

#if((TLE941XY_TLE94106_CHIP_EN == STD_ON)||(TLE941XY_TLE94108_CHIP_EN == STD_ON)||(TLE941XY_TLE94110_CHIP_EN == STD_ON)||(TLE941XY_TLE94112_CHIP_EN == STD_ON))
    l_u8ChipShortFlag = 0u;
    /***OUT5-OUT8**/
    for(j = 0u;j < l_u8ChipNum;j++)
    {
        l_au8RegBuf[j] = TLE941XY_SYS_DIAG_3;
    }
    Tle941xy_ReadReg(u8Group,l_au8RegBuf,l_au8DataBuf);
    sTle941xy_atRegData[u8Group][j].SYS_DIAG_3 = l_au8DataBuf[j];
    for(j = 0u;j < l_u8ChipNum;j++)
    {
        for(j = 0u;k < 4u;k++)
        {
            l_u8DisplacementLen = (uint8)(k * 2u);
            if((l_au8RegBuf[j] && (0x03u << l_u8DisplacementLen)) != 0x00u)
            {
                l_u8ChipShortFlag++;
                if(sTle941xy_u8HbOutSts[u8Group][j][k + 4u] == TLE941XY_OUT_STATUS_LS)
                {
                    sTle941xy_atDiagResult[u8Group][j][k + 4u].eShort2Vcc = PFM_DDS_POS;
                }
                else
                {
                    sTle941xy_atDiagResult[u8Group][j][k + 4u].eShort2Gnd = PFM_DDS_POS;
                }
            }
            else
            {
                sTle941xy_atDiagResult[u8Group][j][k + 4u].eShort2Vcc = PFM_DDS_NEG;
                sTle941xy_atDiagResult[u8Group][j][k + 4u].eShort2Gnd = PFM_DDS_NEG;
            }
        }
    }
    if(l_u8ChipShortFlag > 0u)
    {
        Tle941xy_Recovery(u8Group,l_au8RegBuf);
    }
    else
    {
        
    }
#endif
#if((TLE941XY_TLE94110_CHIP_EN == STD_ON)||(TLE941XY_TLE94112_CHIP_EN == STD_ON))
    l_u8ChipShortFlag = 0u;
    /***OUT9-OUT12**/
    for(j = 0u;j < l_u8ChipNum;j++)
    {
        l_au8RegBuf[j] = TLE941XY_SYS_DIAG_4;
    }
    Tle941xy_ReadReg(u8Group,l_au8RegBuf,l_au8DataBuf);
    sTle941xy_atRegData[u8Group][j].SYS_DIAG_4 = l_au8DataBuf[j];
    for(j = 0u;j < l_u8ChipNum;j++)
    {
        for(j = 0u;k < 4u;k++)
        {
            l_u8DisplacementLen = (uint8)(k * 2u);
            if((l_au8RegBuf[j] && (0x03u << l_u8DisplacementLen)) != 0x00u)
            {
                l_u8ChipShortFlag++;
                if(sTle941xy_u8HbOutSts[u8Group][j][k + 8u] == TLE941XY_OUT_STATUS_LS)
                {
                    sTle941xy_atDiagResult[u8Group][j][k + 8u].eShort2Vcc = PFM_DDS_POS;
                }
                else
                {
                    sTle941xy_atDiagResult[u8Group][j][k + 8u].eShort2Gnd = PFM_DDS_POS;
                }
            }
            else
            {
                sTle941xy_atDiagResult[u8Group][j][k + 8u].eShort2Vcc = PFM_DDS_NEG;
                sTle941xy_atDiagResult[u8Group][j][k + 8u].eShort2Gnd = PFM_DDS_NEG;
            }
        }
        if(l_u8ChipShortFlag > 0u)
        {
            Tle941xy_Recovery(u8Group,l_au8RegBuf);
        }
        else
        {
            
