engr-ping/AUTOSAR_CP_CODE/src/bsw/OnBoardDevices/Tle941xy/Tle941xy.c
        }
    }
#endif
}

static void Tle941xy_Recovery(uint8 u8GroupId,uint8* pu8RegBuf)
{
    uint8 l_au8DataBuf[TLE941XY_CHIP_MAX] = {0};

    (void)memset(l_au8DataBuf,1u,sizeof(l_au8DataBuf));
    /****write 1 clear 0******/
    Tle941xy_WriteReg(u8GroupId,pu8RegBuf,l_au8DataBuf);
}

/****************************************************************************************
| NAME:    Tle941xy_OLDiagnostic
| CALLED BY:
| PRECONDITIONS:     NA
| INPUT PARAMETERS:    void
| RETURN VALUE:     void
| DESCRIPTION:      
****************************************************************************************/
static void Tle941xy_OLDiagnostic(uint8 u8Group)
{

    uint8 j;
    uint8 k;
    uint8 l_au8RegBuf[TLE941XY_CHIP_MAX] = {0};
    uint8 l_au8DataBuf[TLE941XY_CHIP_MAX] = {0};
    uint8 l_u8ChipNum;
    uint8 l_u8DisplacementLen;

    l_u8ChipNum = *cTle941xy_atGroupCfg[u8Group].pu8ChipNum;
    /***OUT1-OUT4**/
    for(j = 0u;j < l_u8ChipNum;j++)
    {
        l_au8RegBuf[j] = TLE941XY_SYS_DIAG_5;
    }
    Tle941xy_ReadReg(u8Group,l_au8RegBuf,l_au8DataBuf);
    sTle941xy_atRegData[u8Group][j].SYS_DIAG_5 = l_au8DataBuf[j];
    for(j = 0u;j < l_u8ChipNum;j++)
    {
        for(j = 0u;k < 4u;k++)
        {
            l_u8DisplacementLen = (uint8)(k * 2u);
            if((l_au8RegBuf[j] && (0x03u << l_u8DisplacementLen)) != 0x00u)
            { 
                sTle941xy_atDiagResult[u8Group][j][k].eOpenLoad = PFM_DDS_POS; 
            }
            else
            {
                sTle941xy_atDiagResult[u8Group][j][k].eOpenLoad = PFM_DDS_NEG;
            }
        }
    }

#if((TLE941XY_TLE94106_CHIP_EN == STD_ON)||(TLE941XY_TLE94108_CHIP_EN == STD_ON)||(TLE941XY_TLE94110_CHIP_EN == STD_ON)||(TLE941XY_TLE94112_CHIP_EN == STD_ON))
    /***OUT5-OUT8**/
    for(j = 0u;j < l_u8ChipNum;j++)
    {
        l_au8RegBuf[j] = TLE941XY_SYS_DIAG_6;
    }
    Tle941xy_ReadReg(u8Group,l_au8RegBuf,l_au8DataBuf);
    sTle941xy_atRegData[u8Group][j].SYS_DIAG_6 = l_au8DataBuf[j];
    for(j = 0u;j < l_u8ChipNum;j++)
    {
        for(j = 0u;k < 4u;k++)
        {
            l_u8DisplacementLen = (uint8)(k * 2u);
            if((l_au8RegBuf[j] && (0x03u << l_u8DisplacementLen)) != 0x00u)
            { 
                sTle941xy_atDiagResult[u8Group][j][k + 4u].eOpenLoad = PFM_DDS_POS; 
            }
            else
            {
                sTle941xy_atDiagResult[u8Group][j][k + 4u].eOpenLoad = PFM_DDS_NEG;
            }
        }
    }
#endif
#if((TLE941XY_TLE94110_CHIP_EN == STD_ON)||(TLE941XY_TLE94112_CHIP_EN == STD_ON))
    /***OUT9-OUT12**/
    for(j = 0u;j < l_u8ChipNum;j++)
    {
        l_au8RegBuf[j] = TLE941XY_SYS_DIAG_7;
    }
    Tle941xy_ReadReg(u8Group,l_au8RegBuf,l_au8DataBuf);
    sTle941xy_atRegData[u8Group][j].SYS_DIAG_7 = l_au8DataBuf[j];
    for(j = 0u;j < l_u8ChipNum;j++)
    {
        for(j = 0u;k < 4u;k++)
        {
            l_u8DisplacementLen = (uint8)(k * 2u);
            if((l_au8RegBuf[j] && (0x03u << l_u8DisplacementLen)) != 0x00u)
            { 
                sTle941xy_atDiagResult[u8Group][j][k + 8u].eOpenLoad = PFM_DDS_POS; 
            }
            else
            {
                sTle941xy_atDiagResult[u8Group][j][k + 8u].eOpenLoad = PFM_DDS_NEG;
            }
        }
    }
#endif
}

void Tle941xy_Init(void)
{
    uint8 i;
    uint8 j;
    uint8 l_u8ChipNum;

    (void)memset(sTle941xy_u8HbOutSts,0u,sizeof(sTle941xy_u8HbOutSts));
    for(i = 0u;i < TLE941XY_GROUP_MAX;i++)
    {
        l_u8ChipNum = *cTle941xy_atGroupCfg[i].pu8ChipNum;
        for(j = 0u;j < l_u8ChipNum;j++)
        {
            Dio_WriteChannel(cTle941xy_atChipCfg[i][j].u8ChipEnPin, STD_ON);
        }
        Tle941xy_ReadDeviceIdReg(i);
        Tle941xy_SetHbModeReg(i);
        Tle941xy_SetFwOlReg(i);
        Tle941xy_SetFmPwmFreqReg(i);
        Tle941xy_SetHbOutputReg(i);
    }
}

void Tle941xy_MainFunction(void)
{
    uint8 i;
    for(i = 0u;i < TLE941XY_GROUP_MAX;i++)
    {
        Tle941xy_ShortDiagnostic(i);
        Tle941xy_OLDiagnostic(i);
        Tle941xy_SetHbPwmDutyReg(i);
        Tle941xy_SetHbOutputReg(i);
    }
}

void Tle941xy_DeInit(void)
{
    uint8 i;
    (void)memset(sTle941xy_u8HbOutSts,0u,sizeof(sTle941xy_u8HbOutSts));
    for(i = 0u;i < TLE941XY_GROUP_MAX;i++)
    {
        Tle941xy_SetHbOutputReg(i);
    }
}

/****************************************************************************************
| NAME:    Tle941xy_WriteHbChn
| CALLED BY:     output layer
| PRECONDITIONS:     NA
| INPUT PARAMETERS:    uint8 channel, uint16 Value
| RETURN VALUE:     void
| DESCRIPTION:      The interface to write value to a DO channel.
 ****************************************************************************************/
void Tle941xy_WriteHbChn(uint8 u8GroupId, uint8 u8ChipId,uint8 u8ChnId, uint8 u8Val)
{
    if((u8GroupId < (uint8)TLE941XY_GROUP_MAX)
    &&(u8ChipId < (uint8)TLE941XY_CHIP_MAX)
    &&(u8ChnId < (uint8)TLE941XY_CHANNEL_MAX))
    {
        sTle941xy_u8HbOutSts[u8GroupId][u8ChipId][u8ChnId] = u8Val;
    }
}

void Tle941xy_WritePwmChn(uint8 u8GroupId, uint8 u8ChipId,uint8 u8PwmChn, uint8 u8Val)
{
    if((u8GroupId < (uint8)TLE941XY_GROUP_MAX)
    &&(u8ChipId < (uint8)TLE941XY_CHIP_MAX)
    &&(u8PwmChn < (uint8)TLE941XY_PWM_CHN_MAX))
    {
        sTle941xy_u8PwmDuty[u8GroupId][u8ChipId][u8PwmChn] = u8Val;
    }
}


Std_ReturnType Tle941xy_SetPwmDutyCycle(uint8 ChannelId, uint8 DutyCycle)
{
    Std_ReturnType l_u8RetVal = E_OK;

    Tle941xy_PwmChnIdType* pu8PwmChnId= NULL;
    if(ChannelId >= TLE941XY_PWM_CHANNEL_MAX)
    {
        pu8PwmChnId = &gTle941xy_PwmChnId[ChannelId];
        Tle941xy_WritePwmChn(pu8PwmChnId->u8GroupId, pu8PwmChnId->u8ChipId, pu8PwmChnId->u8PwmChn, DutyCycle);
    }
    else
    {
        l_u8RetVal = E_NOT_OK;
    }
    return l_u8RetVal;
}

Std_ReturnType Tle941xy_WriteHbChannel(uint8 ChannelId, uint8 Value)
{
    Std_ReturnType l_u8RetVal = E_OK;

    Tle941xy_HbChnIdType* pu8HbChnId= NULL;
    if(ChannelId >= TLE941XY_HB_CHANNEL_MAX)
    {
        pu8HbChnId = &gTle941xy_HbChnId[ChannelId];
        Tle941xy_WriteHbChn(pu8HbChnId->u8GroupId, pu8HbChnId->u8ChipId, pu8HbChnId->u8HbChn, Value);
    }
    else
    {
        l_u8RetVal = E_NOT_OK;
    }
    return l_u8RetVal;
}
